/* This routine will test if the active user has the
   ability to access UID 0 (superuser)
*/

Check_UID0:
  address syscall 'geteuid'   /* get current euid */
  euid = retval
  address syscall 'seteuid 0' /* try to set uid 0 */
  if retval /= 0 then do
     gooduid0 = 1
     zedsmsg = 'Error.'
     zedlmsg = 'Unable to get UID of 0, meaning you do not have' ,
               'access to BPX.SUPERUSER Facility class and will' ,
               'not be able to issue the Remount command.'
     address ispexec 'setmsg msg(isrz001)'
     return
     end
  address syscall 'seteuid' euid  /* reset back */
  return
